g-falast14/STM32-Bare-Metal-Drivers/5_uart_tx/Src/main.c
#include "stm32f4xx.h"
#include <stdint.h>

#define GPIOAEN			(1U<<0)
#define UART2EN			(1U<<17)

#define CR1_TE			(1U<<3)
#define CR1_UE			(1U<<13)
#define SR_TXE			(1U<<7)


#define SYS_FREQ		16000000 //16mhz, 16mil cycles per second
#define APB1_CLK		SYS_FREQ

#define UART_BAUDRATE	115200



void uart2_tx_init(void);
static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate);
static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate);
void uart2_write(int ch);



int main(void) {

	uart2_tx_init();

	while (1) {
		uart2_write('Y');
	}

}




void uart2_tx_init(void) {

	// configure the uart gpio pin
		// enable clock access to gpioa
		RCC->AHB1ENR |= GPIOAEN;

		// set PA2 mode to alternate function mode
		GPIOA->MODER &= ~(1U<<4);
		GPIOA->MODER |= (1U<<5);

		// set PA2 alternate function type to UART_TX (AF07)
		GPIOA->AFR[0] |= (1U<<8);
		GPIOA->AFR[0] |= (1U<<9);
		GPIOA->AFR[0] |= (1U<<10);
		GPIOA->AFR[0] &= ~(1U<11);

	// configure uart module
		// enable clock access to uart2
		RCC->APB1ENR |= UART2EN;

		// configure baudrate
		uart_set_baudrate(USART2, APB1_CLK, UART_BAUDRATE);

		// configure the transfer direction
		USART2->CR1 = CR1_TE;

		// enable the uart module
		USART2->CR1 |= CR1_UE;
}

void uart2_write(int ch) {

	// make sure transmit data register is empty
	while(!(USART2->SR & SR_TXE)) {}

	// write to transmit data register
	USART2->DR = (ch & 0xFF);

}


static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate) {
	USARTx->BRR = compute_uart_bd(PeriphClk, BaudRate);
}

static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate) {
	return ((PeriphClk + (BaudRate/2U))/BaudRate);
}
